#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
aws_placement_group.this: Refreshing state... [id=cluster]
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00aa48a70ce39ad65]
aws_iam_role.non-public-bastion-ssm: Refreshing state... [id=non-public-bastion-ssm]
aws_iam_policy_attachment.non-public-bastion-ssm-1: Refreshing state... [id=attachment-ssm-1]
aws_iam_policy_attachment.non-public-bastion-ssm-2: Refreshing state... [id=attachment-ssm-2]
aws_iam_instance_profile.this: Refreshing state... [id=non-public-bastion-ssm]
module.security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2420128315]
module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1525221313]
module.non_public_bastion.aws_instance.this[0]: Refreshing state... [id=i-079460913102bc988]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.non_public_bastion.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0bfbb40a5f334e955" -> "ami-0929420ab1b11afa5" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:940507879621:instance/i-079460913102bc988" -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + host_id                              = (known after apply)
      ~ id                                   = "i-079460913102bc988" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0d9068b124f075362" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-63.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.63" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "Sandbox"
            "Name"        = "silver-racoon-vpc"
            "Terraform"   = "true"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
        # (15 unchanged attributes hidden)


      ~ credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }


      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ap-northeast-1:940507879621:key/cc222c05-9961-4de1-8fd5-ec525c6fc80f" -> (known after apply)
            tags                  = {
                "Environment" = "Sandbox"
                "Name"        = "root-block-for-non-public-bastion"
                "Terraform"   = "true"
            }
          ~ volume_id             = "vol-0b22fcfd430949b01" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ non_public_bastion_arn                          = "arn:aws:ec2:ap-northeast-1:940507879621:instance/i-079460913102bc988" -> (known after apply)
  ~ non_public_bastion_id                           = "i-079460913102bc988" -> (known after apply)
  ~ non_public_bastion_instance_state               = "running" -> (known after apply)
  ~ non_public_bastion_primary_network_interface_id = "eni-0d9068b124f075362" -> (known after apply)
  ~ non_public_bastion_private_dns                  = "ip-10-0-1-63.ap-northeast-1.compute.internal" -> (known after apply)
  + non_public_bastion_public_dns                   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @tauxi, Action: `pull_request`*